In [2]:
# Consider following code to answer further questions:
import pandas as pd
course_name = ["Data Science", "Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name" : course_name, "duration" : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

<h4>Q1. Write a code to print the data present in the second row of the dataframe, df.

In [4]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

<h4>Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

Ans. loc is primarily used for label indexing, while . iloc is mainly used for integer indexing.

<h4>Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [6]:
new_df=df.reindex([3,0,1,2])
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [7]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

 loc is primarily used for label indexing, while . iloc is mainly used for integer indexing.

<h3>Consider the below code to answer further questions:

In [28]:
import pandas as pd
import numpy as np
columns = ["column_1", "column_2", "column_3", "column_4", "column_5", "column_6"]
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [2]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.009662  0.718158  0.334972  0.540747  0.374500  0.398715
2  0.188980  0.546518  0.994595  0.413022  0.464909  0.708804
3  0.536910  0.495938  0.587765  0.120017  0.629311  0.203316
4  0.522141  0.268529  0.859287  0.177682  0.697832  0.592555
5  0.121306  0.630764  0.455078  0.081714  0.695232  0.037349
6  0.109714  0.105174  0.408717  0.864405  0.313096  0.739096

<h4>Q4. Write a code to find the following statistical measurements for the above dataframe df1:
<br>(i) mean of each and every column present in the dataframe.
<br>(ii) standard deviation of column, ‘column_2’

In [6]:
df1.describe().mean()

column_1    0.965840
column_2    1.121454
column_3    1.241782
column_4    1.069203
column_5    1.166355
column_6    1.116885
dtype: float64

In [9]:
df1['column_2'].std()

0.23114552527146104

<h4>Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
<br>If you are getting errors in executing it then explain why.
<br>[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [30]:
df1['column_2']='a'

In [31]:
df1

   column_1 column_2  column_3  column_4  column_5  column_6
1  0.482253        a  0.467135  0.723374  0.151403  0.001809
2  0.461916        a  0.094319  0.198413  0.566633  0.536877
3  0.697268        a  0.430779  0.693988  0.892422  0.116940
4  0.757055        a  0.743585  0.374598  0.750422  0.330694
5  0.658472        a  0.191522  0.837013  0.908399  0.974345
6  0.747668        a  0.641400  0.253449  0.010222  0.753028

<h5> df1['column_2'].mean()
<h5>Error:         TypeError: Could not convert aaaaaa to numeric

<h4>Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

Ans. A window function performs a calculation across a set of table rows that are somehow related to the current row.Windows function in Pandas can be broadly divided into three categories namely- Aggregate, Ranking, and Value.

<h4>Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [54]:
month=pd.to_datetime('today').date().month
month

9

In [52]:
year=pd.to_datetime('today').date().year
year

2023

<h4>Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [60]:
d1=input("Enter date 1:")
d2=input("Enter date 2:")
d1=pd.to_datetime(d1)
d2=pd.to_datetime(d2)
d1-d2

Enter date 1: 2000-10-10
Enter date 2: 2000-10-10

Timedelta('0 days 00:00:00')

<h4>Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.

In [61]:
df= pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
filepath = input('Enter the filepath: ')
column = input('Enter the column name: ')
order = input('Enter category order: ')

df = pd.read_csv(filepath)

df[column].astype('category')

if order=='ascending':
    df=df.sort_values(by = column, ascending= True)
elif order=='descending':
    df=df.sort_values(by = column, ascending= False)

df

#entered filepath: https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
#entered column: Pclass
#entered order: ascending

Enter the filepath:  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Enter the column name:  Pclass
Enter category order:  ascending

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
306,307,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
379,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<h4>Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart.

In [63]:
filepath = input('Enter filepath: ')

df = pd.read_csv(filepath)
df['Date'] = pd.to_datetime(df['Date'])
grouped = df.groupby(['Product', 'Date']).sum()
pivot = grouped.unstack(level=0)
pivot.plot(kind='bar', stacked=True)

#entered filepath: Product_sales.csv

Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.
The program should do the followingM
I Prompt the user to enter the file path of the CSV file containing the student dataR
I Read the CSV file into a Pandas DataFrameR
I Calculate the mean, median, and mode of the test scores using Pandas toolsR
I Display the mean, median, and mode in a table.
Assume the CSV file contains the following columnsM
I Student ID: The ID of the studentR
I Test Score: The score of the student's test.
Example usage of the program:
Enter the file path of the CSV file containing the student data: student_data.csv
+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean | 79.6 |
| Median | 82 |
| Mode | 85, 90 |
+-----------+--------+
Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85
The program should calculate the mean, median, and mode of the test scores and display the results
in a table.

In [65]:
filepath = input('Enter Filepath: ')

df = pd.read_csv(filepath)

mean = df['Test_Score'].mean()
median = df['Test_Score'].median()
mode = df['Test_Score'].mode()

print("+----------+----------+")
print("Statistic | Value")
print(f"Mean:    {mean}")
print(f"Median:    {median}")
print(f"Mode:    {mode}")
print("+----------+----------+")

#entered fiepath: students_data.csv